#include "conio.h"

void dialog(){//Головне меню програми, вткористовується для переходу до двох інших вікон:
    char ch;//сюди записується ввід користувача
    do{
    system("cls");
    printf("\n\tMainMenu\n\n");
    printf("1. Algorythms Test\n");//вікна перевірки коректності алгоритмів
    printf("2. Shedule Measuring\n");//вікно тестування швидкодії всіх алгоритмів
    printf("3. Shedule Measuring for Vectors\n");//Вікно тестуванняшвидкодії алгоритмів для векторів
    printf("\n0. EXIT\n");
    printf("\nPlease, choose: ");

        ch = getch();//зчитуємо вибір користувача
        //обробка вибору користувача
        if(ch == '1'){
            AlgoCheck();//запуск вікна перевірки коректності алгоритмів
        }
        else if(ch == '2'){
            Shedule();//запуск вікна тестування швидкодії алгоритмів
        }
        else if(ch == '3'){
            vecShedule();//запуск вікна тестування швидкодії алгоритмів для векторів
        }
    }while(ch != '0');//умова виходу з циклу - вибір опції Вихід
}
