#include "sorting.h"
#include "header.h"

clock_t Insert(){//Метод сортування вставкою №1, "вставка зліва"
    int Sum[N];//додатковий вектор для сум стовпців
    int B, i, j, k, t, s;
    clock_t start, stop;//фіксування початку роботи алгоритму і завершення для обрахунку часу роботи

    start = clock();

    for(i = 0; i < P; i++){
        sum(Sum, i);//inline-функція, яка заповнбє вектор Sum

        for(k = 1; k < N; k++){
            B = Sum[k];
            j = 0;
            while(B>Sum[j]) j++;
//переставляються елементи вектора сум
            for(t = k-1; t>=j; t--){
                Sum[t+1] = Sum[t];
            }
            Sum[j] = B;
//і елементи перерізу масиву
            for(s = 0; s < M; s++){
                B = A[i][s][k];
                for(t = k-1; t>=j; t--){
                    A[i][s][t+1] = A[i][s][t];
                }
                A[i][s][j] = B;
            }
        }
    }
    stop = clock();

    return stop - start;
}

inline void sum(int *arr, int i){//функція, яка використовується всіма алгоритмами для обрахунку сум елементів
    //стовпців і - го перерізу. для виконання умови про неприпустимість додаткових викликів всередині алгоритмів,
    //реалізується як inline - функція
    //параметри - номер перерізу та вектор, в який записуються результати
    int k, j;
    for(k = 0; k < N; k++){
        arr[k] = 0;
        for(j = 0; j < M; j++)
            arr[k] += A[i][j][k];
    }
}
