#pragma once
#include <time.h>

clock_t Insert();//Метод сортування вставкою №1, "вставка зліва"
clock_t Select();//Метод сортування №7 методом прямого вибору
clock_t Shaker();//Метод сортування №16 методу прямого обміну, Шейкерне сортування
clock_t QuickSort();//Метод сортування №23, швидке сортування
clock_t vecInsert();//Метод сортування вставкою №1, "вставка зліва" для вектора
clock_t vecSelect();//Метод сортування №7 методом прямого вибору для вектора
clock_t vecShaker();//Метод сортування №16 методу прямого обміну, Шейкерне сортування для вектора
clock_t vecQuickSort();//Метод сортування №23, швидке сортування для вектора

inline void sum(int*, int);//Функція, яка використовується в алгоритмах для заповнення додвткового вектора Sum,
//перший параметр - масив, який заповнюватиметься, другий параметр - індекс поточного перерізу
